Tekla.Structures.ModelInternal.dotGridPlane_t
Struct for the GridPlane

Tekla.Structures.ModelInternal.dotGridPlane_t.aLabel
The Label of the GridPlane

Tekla.Structures.ModelInternal.dotGridPlane_t.Color
Determines the Color of the GridPlane. This works only in wireframe views.

Tekla.Structures.ModelInternal.dotGridPlane_t.DrawingVisibility
Determines if the GridPlane is visible in drawings or not